{
  "<pad>": 0,
  "<s>": 1,
  "</s>": 2,
  "B1e2": 3,
  "B2d4": 4,
  "B3a2": 5,
  "B3c4": 6,
  "B3e4": 7,
  "B4e3": 8,
  "B4e5": 9,
  "B4e6": 10,
  "B4g6": 11,
  "B5d6": 12,
  "B6c7": 13,
  "B6d5": 14,
  "B7d6": 15,
  "B7e6": 16,
  "B7g6": 17,
  "B8c6": 18,
  "B8d6": 19,
  "B8d7": 20,
  "B8f6": 21,
  "B8f7": 22,
  "B8xd6": 23,
  "Ba1": 24,
  "Ba1#": 25,
  "Ba1+": 26,
  "Ba2": 27,
  "Ba2#": 28,
  "Ba2+": 29,
  "Ba3": 30,
  "Ba3#": 31,
  "Ba3+": 32,
  "Ba4": 33,
  "Ba4#": 34,
  "Ba4+": 35,
  "Ba5": 36,
  "Ba5#": 37,
  "Ba5+": 38,
  "Ba6": 39,
  "Ba6#": 40,
  "Ba6+": 41,
  "Ba7": 42,
  "Ba7#": 43,
  "Ba7+": 44,
  "Ba8": 45,
  "Ba8#": 46,
  "Ba8+": 47,
  "Bab1": 48,
  "Bab2": 49,
  "Bab3": 50,
  "Bab6": 51,
  "Bab7": 52,
  "Bac2": 53,
  "Bac3": 54,
  "Bac3+": 55,
  "Bac4": 56,
  "Bac5": 57,
  "Bac6": 58,
  "Bac7": 59,
  "Bad3": 60,
  "Bad4": 61,
  "Bad5": 62,
  "Bad5+": 63,
  "Bad6": 64,
  "Bae4": 65,
  "Bae5": 66,
  "Bae5+": 67,
  "Bae6": 68,
  "Baf6": 69,
  "Bag2": 70,
  "Bag7": 71,
  "Baxb7": 72,
  "Baxc5": 73,
  "Baxc6": 74,
  "Baxe5": 75,
  "Bb1": 76,
  "Bb1#": 77,
  "Bb1+": 78,
  "Bb2": 79,
  "Bb2#": 80,
  "Bb2+": 81,
  "Bb3": 82,
  "Bb3#": 83,
  "Bb3+": 84,
  "Bb4": 85,
  "Bb4#": 86,
  "Bb4+": 87,
  "Bb5": 88,
  "Bb5#": 89,
  "Bb5+": 90,
  "Bb6": 91,
  "Bb6#": 92,
  "Bb6+": 93,
  "Bb7": 94,
  "Bb7#": 95,
  "Bb7+": 96,
  "Bb8": 97,
  "Bb8#": 98,
  "Bb8+": 99,
  "Bba3": 100,
  "Bba7": 101,
  "Bbc2": 102,
  "Bbc3": 103,
  "Bbc3+": 104,
  "Bbc4": 105,
  "Bbc5": 106,
  "Bbd3": 107,
  "Bbd3+": 108,
  "Bbd5": 109,
  "Bbd6": 110,
  "Bbd7": 111,
  "Bbe4": 112,
  "Bbe4#": 113,
  "Bbe4+": 114,
  "Bbe5": 115,
  "Bbf3+": 116,
  "Bbf4": 117,
  "Bbf4+": 118,
  "Bbg3": 119,
  "Bbxa7": 120,
  "Bbxc7#": 121,
  "Bbxd3": 122,
  "Bbxf5": 123,
  "Bc1": 124,
  "Bc1#": 125,
  "Bc1+": 126,
  "Bc2": 127,
  "Bc2#": 128,
  "Bc2+": 129,
  "Bc3": 130,
  "Bc3#": 131,
  "Bc3+": 132,
  "Bc4": 133,
  "Bc4#": 134,
  "Bc4+": 135,
  "Bc5": 136,
  "Bc5#": 137,
  "Bc5+": 138,
  "Bc6": 139,
  "Bc6#": 140,
  "Bc6+": 141,
  "Bc7": 142,
  "Bc7#": 143,
  "Bc7+": 144,
  "Bc8": 145,
  "Bc8#": 146,
  "Bc8+": 147,
  "Bca6": 148,
  "Bcb2": 149,
  "Bcb3": 150,
  "Bcb5": 151,
  "Bcb7": 152,
  "Bcd2": 153,
  "Bcd3": 154,
  "Bcd4": 155,
  "Bcd5+": 156,
  "Bcd6": 157,
  "Bcd7": 158,
  "Bce3": 159,
  "Bce4": 160,
  "Bce6+": 161,
  "Bcf4": 162,
  "Bcf5": 163,
  "Bcg5": 164,
  "Bcg7": 165,
  "Bch3": 166,
  "Bcxg5": 167,
  "Bcxh3": 168,
  "Bd1": 169,
  "Bd1#": 170,
  "Bd1+": 171,
  "Bd2": 172,
  "Bd2#": 173,
  "Bd2+": 174,
  "Bd3": 175,
  "Bd3#": 176,
  "Bd3+": 177,
  "Bd4": 178,
  "Bd4#": 179,
  "Bd4+": 180,
  "Bd5": 181,
  "Bd5#": 182,
  "Bd5+": 183,
  "Bd6": 184,
  "Bd6#": 185,
  "Bd6+": 186,
  "Bd7": 187,
  "Bd7#": 188,
  "Bd7+": 189,
  "Bd8": 190,
  "Bd8#": 191,
  "Bd8+": 192,
  "Bda2": 193,
  "Bdb3": 194,
  "Bdb3+": 195,
  "Bdb6": 196,
  "Bdc2": 197,
  "Bdc6": 198,
  "Bdc7": 199,
  "Bde2": 200,
  "Bde3": 201,
  "Bde4": 202,
  "Bde7": 203,
  "Bdf2": 204,
  "Bdf3": 205,
  "Bdf4": 206,
  "Bdf5": 207,
  "Bdf6": 208,
  "Bdf7": 209,
  "Bdg6": 210,
  "Bdh4": 211,
  "Bdxb6": 212,
  "Bdxe5": 213,
  "Be1": 214,
  "Be1#": 215,
  "Be1+": 216,
  "Be2": 217,
  "Be2#": 218,
  "Be2+": 219,
  "Be3": 220,
  "Be3#": 221,
  "Be3+": 222,
  "Be4": 223,
  "Be4#": 224,
  "Be4+": 225,
  "Be5": 226,
  "Be5#": 227,
  "Be5+": 228,
  "Be6": 229,
  "Be6#": 230,
  "Be6+": 231,
  "Be7": 232,
  "Be7#": 233,
  "Be7+": 234,
  "Be8": 235,
  "Be8#": 236,
  "Be8+": 237,
  "Beb2": 238,
  "Beb6": 239,
  "Bec3": 240,
  "Bec4": 241,
  "Bec5": 242,
  "Bed1": 243,
  "Bed2": 244,
  "Bed3": 245,
  "Bed4": 246,
  "Bed5": 247,
  "Bed6": 248,
  "Bed7": 249,
  "Bef3+": 250,
  "Bef6": 251,
  "Bef7+": 252,
  "Beg2+": 253,
  "Beg3": 254,
  "Beg4": 255,
  "Beg5": 256,
  "Beg7": 257,
  "Beh4": 258,
  "Bexd2": 259,
  "Bf1": 260,
  "Bf1#": 261,
  "Bf1+": 262,
  "Bf2": 263,
  "Bf2#": 264,
  "Bf2+": 265,
  "Bf3": 266,
  "Bf3#": 267,
  "Bf3+": 268,
  "Bf4": 269,
  "Bf4#": 270,
  "Bf4+": 271,
  "Bf5": 272,
  "Bf5#": 273,
  "Bf5+": 274,
  "Bf6": 275,
  "Bf6#": 276,
  "Bf6+": 277,
  "Bf7": 278,
  "Bf7#": 279,
  "Bf7+": 280,
  "Bf8": 281,
  "Bf8#": 282,
  "Bf8+": 283,
  "Bfb5": 284,
  "Bfb6+": 285,
  "Bfb7": 286,
  "Bfc4": 287,
  "Bfc5": 288,
  "Bfd3": 289,
  "Bfd4": 290,
  "Bfd6": 291,
  "Bfe2": 292,
  "Bfe2#": 293,
  "Bfe4": 294,
  "Bfe6": 295,
  "Bfe7": 296,
  "Bfg2": 297,
  "Bfg4": 298,
  "Bfg7": 299,
  "Bfxe3": 300,
  "Bfxe7": 301,
  "Bg1": 302,
  "Bg1#": 303,
  "Bg1+": 304,
  "Bg2": 305,
  "Bg2#": 306,
  "Bg2+": 307,
  "Bg3": 308,
  "Bg3#": 309,
  "Bg3+": 310,
  "Bg4": 311,
  "Bg4#": 312,
  "Bg4+": 313,
  "Bg5": 314,
  "Bg5#": 315,
  "Bg5+": 316,
  "Bg6": 317,
  "Bg6#": 318,
  "Bg6+": 319,
  "Bg7": 320,
  "Bg7#": 321,
  "Bg7+": 322,
  "Bg8": 323,
  "Bg8#": 324,
  "Bg8+": 325,
  "Bgc4": 326,
  "Bgd4": 327,
  "Bgd4+": 328,
  "Bgd5": 329,
  "Bgd5+": 330,
  "Bge3": 331,
  "Bge3+": 332,
  "Bge4": 333,
  "Bge4+": 334,
  "Bge5": 335,
  "Bge6": 336,
  "Bge6+": 337,
  "Bgf3": 338,
  "Bgf4": 339,
  "Bgf5": 340,
  "Bgf6": 341,
  "Bgf7": 342,
  "Bgh2": 343,
  "Bgh7": 344,
  "Bgxd7#": 345,
  "Bgxf6": 346,
  "Bgxf6#": 347,
  "Bh1": 348,
  "Bh1#": 349,
  "Bh1+": 350,
  "Bh2": 351,
  "Bh2#": 352,
  "Bh2+": 353,
  "Bh3": 354,
  "Bh3#": 355,
  "Bh3+": 356,
  "Bh4": 357,
  "Bh4#": 358,
  "Bh4+": 359,
  "Bh5": 360,
  "Bh5#": 361,
  "Bh5+": 362,
  "Bh6": 363,
  "Bh6#": 364,
  "Bh6+": 365,
  "Bh7": 366,
  "Bh7#": 367,
  "Bh7+": 368,
  "Bh8": 369,
  "Bh8#": 370,
  "Bh8+": 371,
  "Bhc6": 372,
  "Bhd3": 373,
  "Bhd4": 374,
  "Bhd5": 375,
  "Bhe5": 376,
  "Bhe5+": 377,
  "Bhe6": 378,
  "Bhf3": 379,
  "Bhf3+": 380,
  "Bhf5": 381,
  "Bhf6": 382,
  "Bhg2": 383,
  "Bhg2+": 384,
  "Bhg3": 385,
  "Bhg4": 386,
  "Bhg6+": 387,
  "Bhg7": 388,
  "Bhxf6": 389,
  "Bhxg6": 390,
  "Bxa1": 391,
  "Bxa1#": 392,
  "Bxa1+": 393,
  "Bxa2": 394,
  "Bxa2#": 395,
  "Bxa2+": 396,
  "Bxa3": 397,
  "Bxa3#": 398,
  "Bxa3+": 399,
  "Bxa4": 400,
  "Bxa4#": 401,
  "Bxa4+": 402,
  "Bxa5": 403,
  "Bxa5#": 404,
  "Bxa5+": 405,
  "Bxa6": 406,
  "Bxa6#": 407,
  "Bxa6+": 408,
  "Bxa7": 409,
  "Bxa7#": 410,
  "Bxa7+": 411,
  "Bxa8": 412,
  "Bxa8#": 413,
  "Bxa8+": 414,
  "Bxb1": 415,
  "Bxb1#": 416,
  "Bxb1+": 417,
  "Bxb2": 418,
  "Bxb2#": 419,
  "Bxb2+": 420,
  "Bxb3": 421,
  "Bxb3#": 422,
  "Bxb3+": 423,
  "Bxb4": 424,
  "Bxb4#": 425,
  "Bxb4+": 426,
  "Bxb5": 427,
  "Bxb5#": 428,
  "Bxb5+": 429,
  "Bxb6": 430,
  "Bxb6#": 431,
  "Bxb6+": 432,
  "Bxb7": 433,
  "Bxb7#": 434,
  "Bxb7+": 435,
  "Bxb8": 436,
  "Bxb8#": 437,
  "Bxb8+": 438,
  "Bxc1": 439,
  "Bxc1#": 440,
  "Bxc1+": 441,
  "Bxc2": 442,
  "Bxc2#": 443,
  "Bxc2+": 444,
  "Bxc3": 445,
  "Bxc3#": 446,
  "Bxc3+": 447,
  "Bxc4": 448,
  "Bxc4#": 449,
  "Bxc4+": 450,
  "Bxc5": 451,
  "Bxc5#": 452,
  "Bxc5+": 453,
  "Bxc6": 454,
  "Bxc6#": 455,
  "Bxc6+": 456,
  "Bxc7": 457,
  "Bxc7#": 458,
  "Bxc7+": 459,
  "Bxc8": 460,
  "Bxc8#": 461,
  "Bxc8+": 462,
  "Bxd1": 463,
  "Bxd1#": 464,
  "Bxd1+": 465,
  "Bxd2": 466,
  "Bxd2#": 467,
  "Bxd2+": 468,
  "Bxd3": 469,
  "Bxd3#": 470,
  "Bxd3+": 471,
  "Bxd4": 472,
  "Bxd4#": 473,
  "Bxd4+": 474,
  "Bxd5": 475,
  "Bxd5#": 476,
  "Bxd5+": 477,
  "Bxd6": 478,
  "Bxd6#": 479,
  "Bxd6+": 480,
  "Bxd7": 481,
  "Bxd7#": 482,
  "Bxd7+": 483,
  "Bxd8": 484,
  "Bxd8#": 485,
  "Bxd8+": 486,
  "Bxe1": 487,
  "Bxe1#": 488,
  "Bxe1+": 489,
  "Bxe2": 490,
  "Bxe2#": 491,
  "Bxe2+": 492,
  "Bxe3": 493,
  "Bxe3#": 494,
  "Bxe3+": 495,
  "Bxe4": 496,
  "Bxe4#": 497,
  "Bxe4+": 498,
  "Bxe5": 499,
  "Bxe5#": 500,
  "Bxe5+": 501,
  "Bxe6": 502,
  "Bxe6#": 503,
  "Bxe6+": 504,
  "Bxe7": 505,
  "Bxe7#": 506,
  "Bxe7+": 507,
  "Bxe8": 508,
  "Bxe8#": 509,
  "Bxe8+": 510,
  "Bxf1": 511,
  "Bxf1#": 512,
  "Bxf1+": 513,
  "Bxf2": 514,
  "Bxf2#": 515,
  "Bxf2+": 516,
  "Bxf3": 517,
  "Bxf3#": 518,
  "Bxf3+": 519,
  "Bxf4": 520,
  "Bxf4#": 521,
  "Bxf4+": 522,
  "Bxf5": 523,
  "Bxf5#": 524,
  "Bxf5+": 525,
  "Bxf6": 526,
  "Bxf6#": 527,
  "Bxf6+": 528,
  "Bxf7": 529,
  "Bxf7#": 530,
  "Bxf7+": 531,
  "Bxf8": 532,
  "Bxf8#": 533,
  "Bxf8+": 534,
  "Bxg1": 535,
  "Bxg1#": 536,
  "Bxg1+": 537,
  "Bxg2": 538,
  "Bxg2#": 539,
  "Bxg2+": 540,
  "Bxg3": 541,
  "Bxg3#": 542,
  "Bxg3+": 543,
  "Bxg4": 544,
  "Bxg4#": 545,
  "Bxg4+": 546,
  "Bxg5": 547,
  "Bxg5#": 548,
  "Bxg5+": 549,
  "Bxg6": 550,
  "Bxg6#": 551,
  "Bxg6+": 552,
  "Bxg7": 553,
  "Bxg7#": 554,
  "Bxg7+": 555,
  "Bxg8": 556,
  "Bxg8#": 557,
  "Bxg8+": 558,
  "Bxh1": 559,
  "Bxh1#": 560,
  "Bxh1+": 561,
  "Bxh2": 562,
  "Bxh2#": 563,
  "Bxh2+": 564,
  "Bxh3": 565,
  "Bxh3#": 566,
  "Bxh3+": 567,
  "Bxh4": 568,
  "Bxh4#": 569,
  "Bxh4+": 570,
  "Bxh5": 571,
  "Bxh5#": 572,
  "Bxh5+": 573,
  "Bxh6": 574,
  "Bxh6#": 575,
  "Bxh6+": 576,
  "Bxh7": 577,
  "Bxh7#": 578,
  "Bxh7+": 579,
  "Bxh8": 580,
  "Bxh8#": 581,
  "Bxh8+": 582,
  "Ka1": 583,
  "Ka1+": 584,
  "Ka2": 585,
  "Ka2#": 586,
  "Ka2+": 587,
  "Ka3": 588,
  "Ka3+": 589,
  "Ka4": 590,
  "Ka4+": 591,
  "Ka5": 592,
  "Ka5+": 593,
  "Ka6": 594,
  "Ka6+": 595,
  "Ka7": 596,
  "Ka7#": 597,
  "Ka7+": 598,
  "Ka8": 599,
  "Ka8+": 600,
  "Kb1": 601,
  "Kb1#": 602,
  "Kb1+": 603,
  "Kb2": 604,
  "Kb2#": 605,
  "Kb2+": 606,
  "Kb3": 607,
  "Kb3#": 608,
  "Kb3+": 609,
  "Kb4": 610,
  "Kb4#": 611,
  "Kb4+": 612,
  "Kb5": 613,
  "Kb5#": 614,
  "Kb5+": 615,
  "Kb6": 616,
  "Kb6#": 617,
  "Kb6+": 618,
  "Kb7": 619,
  "Kb7#": 620,
  "Kb7+": 621,
  "Kb8": 622,
  "Kb8+": 623,
  "Kc1": 624,
  "Kc1+": 625,
  "Kc2": 626,
  "Kc2#": 627,
  "Kc2+": 628,
  "Kc3": 629,
  "Kc3#": 630,
  "Kc3+": 631,
  "Kc4": 632,
  "Kc4#": 633,
  "Kc4+": 634,
  "Kc5": 635,
  "Kc5#": 636,
  "Kc5+": 637,
  "Kc6": 638,
  "Kc6#": 639,
  "Kc6+": 640,
  "Kc7": 641,
  "Kc7#": 642,
  "Kc7+": 643,
  "Kc8": 644,
  "Kc8#": 645,
  "Kc8+": 646,
  "Kd1": 647,
  "Kd1#": 648,
  "Kd1+": 649,
  "Kd2": 650,
  "Kd2#": 651,
  "Kd2+": 652,
  "Kd3": 653,
  "Kd3#": 654,
  "Kd3+": 655,
  "Kd4": 656,
  "Kd4#": 657,
  "Kd4+": 658,
  "Kd5": 659,
  "Kd5#": 660,
  "Kd5+": 661,
  "Kd6": 662,
  "Kd6#": 663,
  "Kd6+": 664,
  "Kd7": 665,
  "Kd7#": 666,
  "Kd7+": 667,
  "Kd8": 668,
  "Kd8#": 669,
  "Kd8+": 670,
  "Ke1": 671,
  "Ke1#": 672,
  "Ke1+": 673,
  "Ke2": 674,
  "Ke2#": 675,
  "Ke2+": 676,
  "Ke3": 677,
  "Ke3#": 678,
  "Ke3+": 679,
  "Ke4": 680,
  "Ke4#": 681,
  "Ke4+": 682,
  "Ke5": 683,
  "Ke5#": 684,
  "Ke5+": 685,
  "Ke6": 686,
  "Ke6#": 687,
  "Ke6+": 688,
  "Ke7": 689,
  "Ke7#": 690,
  "Ke7+": 691,
  "Ke8": 692,
  "Ke8#": 693,
  "Ke8+": 694,
  "Kf1": 695,
  "Kf1#": 696,
  "Kf1+": 697,
  "Kf2": 698,
  "Kf2#": 699,
  "Kf2+": 700,
  "Kf3": 701,
  "Kf3#": 702,
  "Kf3+": 703,
  "Kf4": 704,
  "Kf4#": 705,
  "Kf4+": 706,
  "Kf5": 707,
  "Kf5#": 708,
  "Kf5+": 709,
  "Kf6": 710,
  "Kf6#": 711,
  "Kf6+": 712,
  "Kf7": 713,
  "Kf7#": 714,
  "Kf7+": 715,
  "Kf8": 716,
  "Kf8#": 717,
  "Kf8+": 718,
  "Kg1": 719,
  "Kg1#": 720,
  "Kg1+": 721,
  "Kg2": 722,
  "Kg2#": 723,
  "Kg2+": 724,
  "Kg3": 725,
  "Kg3#": 726,
  "Kg3+": 727,
  "Kg4": 728,
  "Kg4#": 729,
  "Kg4+": 730,
  "Kg5": 731,
  "Kg5#": 732,
  "Kg5+": 733,
  "Kg6": 734,
  "Kg6#": 735,
  "Kg6+": 736,
  "Kg7": 737,
  "Kg7#": 738,
  "Kg7+": 739,
  "Kg8": 740,
  "Kg8#": 741,
  "Kg8+": 742,
  "Kh1": 743,
  "Kh1+": 744,
  "Kh2": 745,
  "Kh2#": 746,
  "Kh2+": 747,
  "Kh3": 748,
  "Kh3+": 749,
  "Kh4": 750,
  "Kh4#": 751,
  "Kh4+": 752,
  "Kh5": 753,
  "Kh5#": 754,
  "Kh5+": 755,
  "Kh6": 756,
  "Kh6+": 757,
  "Kh7": 758,
  "Kh7#": 759,
  "Kh7+": 760,
  "Kh8": 761,
  "Kh8+": 762,
  "Kxa1": 763,
  "Kxa1+": 764,
  "Kxa2": 765,
  "Kxa2+": 766,
  "Kxa3": 767,
  "Kxa3+": 768,
  "Kxa4": 769,
  "Kxa4+": 770,
  "Kxa5": 771,
  "Kxa5+": 772,
  "Kxa6": 773,
  "Kxa6+": 774,
  "Kxa7": 775,
  "Kxa7+": 776,
  "Kxa8": 777,
  "Kxb1": 778,
  "Kxb1+": 779,
  "Kxb2": 780,
  "Kxb2+": 781,
  "Kxb3": 782,
  "Kxb3+": 783,
  "Kxb4": 784,
  "Kxb4+": 785,
  "Kxb5": 786,
  "Kxb5#": 787,
  "Kxb5+": 788,
  "Kxb6": 789,
  "Kxb6#": 790,
  "Kxb6+": 791,
  "Kxb7": 792,
  "Kxb7+": 793,
  "Kxb8": 794,
  "Kxb8+": 795,
  "Kxc1": 796,
  "Kxc1+": 797,
  "Kxc2": 798,
  "Kxc2#": 799,
  "Kxc2+": 800,
  "Kxc3": 801,
  "Kxc3+": 802,
  "Kxc4": 803,
  "Kxc4#": 804,
  "Kxc4+": 805,
  "Kxc5": 806,
  "Kxc5#": 807,
  "Kxc5+": 808,
  "Kxc6": 809,
  "Kxc6#": 810,
  "Kxc6+": 811,
  "Kxc7": 812,
  "Kxc7#": 813,
  "Kxc7+": 814,
  "Kxc8": 815,
  "Kxc8+": 816,
  "Kxd1": 817,
  "Kxd1+": 818,
  "Kxd2": 819,
  "Kxd2#": 820,
  "Kxd2+": 821,
  "Kxd3": 822,
  "Kxd3+": 823,
  "Kxd4": 824,
  "Kxd4#": 825,
  "Kxd4+": 826,
  "Kxd5": 827,
  "Kxd5#": 828,
  "Kxd5+": 829,
  "Kxd6": 830,
  "Kxd6#": 831,
  "Kxd6+": 832,
  "Kxd7": 833,
  "Kxd7+": 834,
  "Kxd8": 835,
  "Kxd8+": 836,
  "Kxe1": 837,
  "Kxe1+": 838,
  "Kxe2": 839,
  "Kxe2#": 840,
  "Kxe2+": 841,
  "Kxe3": 842,
  "Kxe3#": 843,
  "Kxe3+": 844,
  "Kxe4": 845,
  "Kxe4+": 846,
  "Kxe5": 847,
  "Kxe5+": 848,
  "Kxe6": 849,
  "Kxe6#": 850,
  "Kxe6+": 851,
  "Kxe7": 852,
  "Kxe7#": 853,
  "Kxe7+": 854,
  "Kxe8": 855,
  "Kxe8+": 856,
  "Kxf1": 857,
  "Kxf1+": 858,
  "Kxf2": 859,
  "Kxf2#": 860,
  "Kxf2+": 861,
  "Kxf3": 862,
  "Kxf3#": 863,
  "Kxf3+": 864,
  "Kxf4": 865,
  "Kxf4#": 866,
  "Kxf4+": 867,
  "Kxf5": 868,
  "Kxf5#": 869,
  "Kxf5+": 870,
  "Kxf6": 871,
  "Kxf6#": 872,
  "Kxf6+": 873,
  "Kxf7": 874,
  "Kxf7#": 875,
  "Kxf7+": 876,
  "Kxf8": 877,
  "Kxf8+": 878,
  "Kxg1": 879,
  "Kxg1+": 880,
  "Kxg2": 881,
  "Kxg2+": 882,
  "Kxg3": 883,
  "Kxg3#": 884,
  "Kxg3+": 885,
  "Kxg4": 886,
  "Kxg4#": 887,
  "Kxg4+": 888,
  "Kxg5": 889,
  "Kxg5#": 890,
  "Kxg5+": 891,
  "Kxg6": 892,
  "Kxg6#": 893,
  "Kxg6+": 894,
  "Kxg7": 895,
  "Kxg7#": 896,
  "Kxg7+": 897,
  "Kxg8": 898,
  "Kxg8+": 899,
  "Kxh1": 900,
  "Kxh1+": 901,
  "Kxh2": 902,
  "Kxh2+": 903,
  "Kxh3": 904,
  "Kxh3+": 905,
  "Kxh4": 906,
  "Kxh4#": 907,
  "Kxh4+": 908,
  "Kxh5": 909,
  "Kxh5#": 910,
  "Kxh5+": 911,
  "Kxh6": 912,
  "Kxh6+": 913,
  "Kxh7": 914,
  "Kxh7+": 915,
  "Kxh8": 916,
  "Kxh8+": 917,
  "N1a2": 918,
  "N1a2+": 919,
  "N1a3": 920,
  "N1a3+": 921,
  "N1b2": 922,
  "N1b2+": 923,
  "N1b3": 924,
  "N1b3+": 925,
  "N1c2": 926,
  "N1c2+": 927,
  "N1c3": 928,
  "N1c3+": 929,
  "N1d2": 930,
  "N1d2#": 931,
  "N1d2+": 932,
  "N1d3": 933,
  "N1d3+": 934,
  "N1e2": 935,
  "N1e2+": 936,
  "N1e3": 937,
  "N1e3#": 938,
  "N1e3+": 939,
  "N1f2": 940,
  "N1f2+": 941,
  "N1f3": 942,
  "N1f3#": 943,
  "N1f3+": 944,
  "N1g2": 945,
  "N1g2#": 946,
  "N1g2+": 947,
  "N1g3": 948,
  "N1g3+": 949,
  "N1h2": 950,
  "N1h2+": 951,
  "N1h3": 952,
  "N1h3+": 953,
  "N1xa2": 954,
  "N1xa3": 955,
  "N1xa3+": 956,
  "N1xb2": 957,
  "N1xb3": 958,
  "N1xb3+": 959,
  "N1xc2": 960,
  "N1xc3": 961,
  "N1xc3+": 962,
  "N1xd2": 963,
  "N1xd2+": 964,
  "N1xd3": 965,
  "N1xd3+": 966,
  "N1xe2": 967,
  "N1xe2+": 968,
  "N1xe3": 969,
  "N1xe3+": 970,
  "N1xf2": 971,
  "N1xf2+": 972,
  "N1xf3": 973,
  "N1xf3+": 974,
  "N1xg2": 975,
  "N1xg3": 976,
  "N1xg3#": 977,
  "N1xg3+": 978,
  "N1xh2": 979,
  "N1xh3": 980,
  "N2a3": 981,
  "N2a3+": 982,
  "N2a4": 983,
  "N2a4+": 984,
  "N2b3": 985,
  "N2b3#": 986,
  "N2b3+": 987,
  "N2b4": 988,
  "N2b4+": 989,
  "N2c3": 990,
  "N2c3+": 991,
  "N2c4": 992,
  "N2c4+": 993,
  "N2d3": 994,
  "N2d3#": 995,
  "N2d3+": 996,
  "N2d4": 997,
  "N2d4#": 998,
  "N2d4+": 999,
  "N2e3": 1000,
  "N2e3+": 1001,
  "N2e4": 1002,
  "N2e4#": 1003,
  "N2e4+": 1004,
  "N2f3": 1005,
  "N2f3#": 1006,
  "N2f3+": 1007,
  "N2f4": 1008,
  "N2f4#": 1009,
  "N2f4+": 1010,
  "N2g3": 1011,
  "N2g3#": 1012,
  "N2g3+": 1013,
  "N2g4": 1014,
  "N2g4+": 1015,
  "N2h3": 1016,
  "N2h3+": 1017,
  "N2h4": 1018,
  "N2h4+": 1019,
  "N2xa3": 1020,
  "N2xa3+": 1021,
  "N2xa4": 1022,
  "N2xa4+": 1023,
  "N2xb3": 1024,
  "N2xb3+": 1025,
  "N2xb4": 1026,
  "N2xb4+": 1027,
  "N2xc3": 1028,
  "N2xc3+": 1029,
  "N2xc4": 1030,
  "N2xc4+": 1031,
  "N2xd3": 1032,
  "N2xd3+": 1033,
  "N2xd4": 1034,
  "N2xd4+": 1035,
  "N2xe3": 1036,
  "N2xe3+": 1037,
  "N2xe4": 1038,
  "N2xe4+": 1039,
  "N2xf3": 1040,
  "N2xf3+": 1041,
  "N2xf4": 1042,
  "N2xf4+": 1043,
  "N2xg3": 1044,
  "N2xg3+": 1045,
  "N2xg4": 1046,
  "N2xg4+": 1047,
  "N2xh3": 1048,
  "N2xh3+": 1049,
  "N2xh4": 1050,
  "N2xh4+": 1051,
  "N3a2": 1052,
  "N3a2+": 1053,
  "N3a4": 1054,
  "N3a4#": 1055,
  "N3a4+": 1056,
  "N3a5": 1057,
  "N3a5+": 1058,
  "N3b2": 1059,
  "N3b2+": 1060,
  "N3b4": 1061,
  "N3b4#": 1062,
  "N3b4+": 1063,
  "N3b5": 1064,
  "N3b5+": 1065,
  "N3c2": 1066,
  "N3c2+": 1067,
  "N3c4": 1068,
  "N3c4+": 1069,
  "N3c5": 1070,
  "N3c5#": 1071,
  "N3c5+": 1072,
  "N3d2": 1073,
  "N3d2+": 1074,
  "N3d4": 1075,
  "N3d4#": 1076,
  "N3d4+": 1077,
  "N3d5": 1078,
  "N3d5#": 1079,
  "N3d5+": 1080,
  "N3e2": 1081,
  "N3e2+": 1082,
  "N3e4": 1083,
  "N3e4#": 1084,
  "N3e4+": 1085,
  "N3e5": 1086,
  "N3e5+": 1087,
  "N3f2": 1088,
  "N3f2+": 1089,
  "N3f4": 1090,
  "N3f4+": 1091,
  "N3f5": 1092,
  "N3f5#": 1093,
  "N3f5+": 1094,
  "N3g2": 1095,
  "N3g2+": 1096,
  "N3g4": 1097,
  "N3g4#": 1098,
  "N3g4+": 1099,
  "N3g5": 1100,
  "N3g5#": 1101,
  "N3g5+": 1102,
  "N3h2": 1103,
  "N3h2+": 1104,
  "N3h4": 1105,
  "N3h4+": 1106,
  "N3h5": 1107,
  "N3h5+": 1108,
  "N3xa2": 1109,
  "N3xa4": 1110,
  "N3xa4+": 1111,
  "N3xa5": 1112,
  "N3xa5+": 1113,
  "N3xb2": 1114,
  "N3xb4": 1115,
  "N3xb4+": 1116,
  "N3xb5": 1117,
  "N3xb5+": 1118,
  "N3xc2": 1119,
  "N3xc2+": 1120,
  "N3xc4": 1121,
  "N3xc4+": 1122,
  "N3xc5": 1123,
  "N3xc5+": 1124,
  "N3xd2": 1125,
  "N3xd4": 1126,
  "N3xd4+": 1127,
  "N3xd5": 1128,
  "N3xd5+": 1129,
  "N3xe2": 1130,
  "N3xe2+": 1131,
  "N3xe4": 1132,
  "N3xe4+": 1133,
  "N3xe5": 1134,
  "N3xe5+": 1135,
  "N3xf2": 1136,
  "N3xf2+": 1137,
  "N3xf4": 1138,
  "N3xf4+": 1139,
  "N3xf5": 1140,
  "N3xf5+": 1141,
  "N3xg2": 1142,
  "N3xg4": 1143,
  "N3xg4+": 1144,
  "N3xg5": 1145,
  "N3xg5+": 1146,
  "N3xh2": 1147,
  "N3xh2+": 1148,
  "N3xh4": 1149,
  "N3xh4#": 1150,
  "N3xh4+": 1151,
  "N3xh5": 1152,
  "N3xh5+": 1153,
  "N4a3": 1154,
  "N4a3+": 1155,
  "N4a5": 1156,
  "N4a5+": 1157,
  "N4a6": 1158,
  "N4a6+": 1159,
  "N4b3": 1160,
  "N4b3#": 1161,
  "N4b3+": 1162,
  "N4b5": 1163,
  "N4b5+": 1164,
  "N4b6": 1165,
  "N4b6#": 1166,
  "N4b6+": 1167,
  "N4c3": 1168,
  "N4c3#": 1169,
  "N4c3+": 1170,
  "N4c5": 1171,
  "N4c5#": 1172,
  "N4c5+": 1173,
  "N4c6": 1174,
  "N4c6+": 1175,
  "N4d3": 1176,
  "N4d3#": 1177,
  "N4d3+": 1178,
  "N4d5": 1179,
  "N4d5#": 1180,
  "N4d5+": 1181,
  "N4d6": 1182,
  "N4d6+": 1183,
  "N4e3": 1184,
  "N4e3#": 1185,
  "N4e3+": 1186,
  "N4e5": 1187,
  "N4e5#": 1188,
  "N4e5+": 1189,
  "N4e6": 1190,
  "N4e6+": 1191,
  "N4f3": 1192,
  "N4f3#": 1193,
  "N4f3+": 1194,
  "N4f5": 1195,
  "N4f5#": 1196,
  "N4f5+": 1197,
  "N4f6": 1198,
  "N4f6#": 1199,
  "N4f6+": 1200,
  "N4g3": 1201,
  "N4g3#": 1202,
  "N4g3+": 1203,
  "N4g5": 1204,
  "N4g5#": 1205,
  "N4g5+": 1206,
  "N4g6": 1207,
  "N4g6#": 1208,
  "N4g6+": 1209,
  "N4h3": 1210,
  "N4h3#": 1211,
  "N4h3+": 1212,
  "N4h5": 1213,
  "N4h5#": 1214,
  "N4h5+": 1215,
  "N4h6": 1216,
  "N4h6+": 1217,
  "N4xa3": 1218,
  "N4xa3+": 1219,
  "N4xa5": 1220,
  "N4xa5+": 1221,
  "N4xa6": 1222,
  "N4xb3": 1223,
  "N4xb3#": 1224,
  "N4xb3+": 1225,
  "N4xb5": 1226,
  "N4xb5+": 1227,
  "N4xb6": 1228,
  "N4xb6+": 1229,
  "N4xc3": 1230,
  "N4xc3+": 1231,
  "N4xc5": 1232,
  "N4xc5+": 1233,
  "N4xc6": 1234,
  "N4xc6+": 1235,
  "N4xd3": 1236,
  "N4xd3+": 1237,
  "N4xd5": 1238,
  "N4xd5+": 1239,
  "N4xd6": 1240,
  "N4xd6+": 1241,
  "N4xe3": 1242,
  "N4xe3+": 1243,
  "N4xe5": 1244,
  "N4xe5+": 1245,
  "N4xe6": 1246,
  "N4xe6+": 1247,
  "N4xf3": 1248,
  "N4xf3+": 1249,
  "N4xf5": 1250,
  "N4xf5+": 1251,
  "N4xf6": 1252,
  "N4xf6+": 1253,
  "N4xg3": 1254,
  "N4xg3#": 1255,
  "N4xg3+": 1256,
  "N4xg5": 1257,
  "N4xg5+": 1258,
  "N4xg6": 1259,
  "N4xg6+": 1260,
  "N4xh3": 1261,
  "N4xh3#": 1262,
  "N4xh3+": 1263,
  "N4xh5": 1264,
  "N4xh5+": 1265,
  "N4xh6": 1266,
  "N5a3": 1267,
  "N5a3+": 1268,
  "N5a4": 1269,
  "N5a4+": 1270,
  "N5a6": 1271,
  "N5a6#": 1272,
  "N5a6+": 1273,
  "N5b3": 1274,
  "N5b3+": 1275,
  "N5b4": 1276,
  "N5b4+": 1277,
  "N5b6": 1278,
  "N5b6#": 1279,
  "N5b6+": 1280,
  "N5c3": 1281,
  "N5c3#": 1282,
  "N5c3+": 1283,
  "N5c4": 1284,
  "N5c4#": 1285,
  "N5c4+": 1286,
  "N5c6": 1287,
  "N5c6#": 1288,
  "N5c6+": 1289,
  "N5d3": 1290,
  "N5d3+": 1291,
  "N5d4": 1292,
  "N5d4#": 1293,
  "N5d4+": 1294,
  "N5d6": 1295,
  "N5d6#": 1296,
  "N5d6+": 1297,
  "N5e3": 1298,
  "N5e3+": 1299,
  "N5e4": 1300,
  "N5e4#": 1301,
  "N5e4+": 1302,
  "N5e6": 1303,
  "N5e6#": 1304,
  "N5e6+": 1305,
  "N5f3": 1306,
  "N5f3#": 1307,
  "N5f3+": 1308,
  "N5f4": 1309,
  "N5f4+": 1310,
  "N5f6": 1311,
  "N5f6#": 1312,
  "N5f6+": 1313,
  "N5g3": 1314,
  "N5g3#": 1315,
  "N5g3+": 1316,
  "N5g4": 1317,
  "N5g4#": 1318,
  "N5g4+": 1319,
  "N5g6": 1320,
  "N5g6#": 1321,
  "N5g6+": 1322,
  "N5h3": 1323,
  "N5h3+": 1324,
  "N5h4": 1325,
  "N5h4#": 1326,
  "N5h4+": 1327,
  "N5h6": 1328,
  "N5h6#": 1329,
  "N5h6+": 1330,
  "N5xa3": 1331,
  "N5xa4": 1332,
  "N5xa4+": 1333,
  "N5xa6": 1334,
  "N5xa6+": 1335,
  "N5xb3": 1336,
  "N5xb3+": 1337,
  "N5xb4": 1338,
  "N5xb4+": 1339,
  "N5xb6": 1340,
  "N5xb6#": 1341,
  "N5xb6+": 1342,
  "N5xc3": 1343,
  "N5xc4": 1344,
  "N5xc4+": 1345,
  "N5xc6": 1346,
  "N5xc6+": 1347,
  "N5xd3": 1348,
  "N5xd3+": 1349,
  "N5xd4": 1350,
  "N5xd4+": 1351,
  "N5xd6": 1352,
  "N5xd6+": 1353,
  "N5xe3": 1354,
  "N5xe3+": 1355,
  "N5xe4": 1356,
  "N5xe4+": 1357,
  "N5xe6": 1358,
  "N5xe6+": 1359,
  "N5xf3": 1360,
  "N5xf3+": 1361,
  "N5xf4": 1362,
  "N5xf4+": 1363,
  "N5xf6": 1364,
  "N5xf6#": 1365,
  "N5xf6+": 1366,
  "N5xg3": 1367,
  "N5xg3#": 1368,
  "N5xg3+": 1369,
  "N5xg4": 1370,
  "N5xg4#": 1371,
  "N5xg4+": 1372,
  "N5xg6": 1373,
  "N5xg6#": 1374,
  "N5xg6+": 1375,
  "N5xh3": 1376,
  "N5xh4": 1377,
  "N5xh4+": 1378,
  "N5xh6": 1379,
  "N5xh6#": 1380,
  "N5xh6+": 1381,
  "N6a4": 1382,
  "N6a4+": 1383,
  "N6a5": 1384,
  "N6a5+": 1385,
  "N6a7": 1386,
  "N6a7+": 1387,
  "N6b4": 1388,
  "N6b4+": 1389,
  "N6b5": 1390,
  "N6b5#": 1391,
  "N6b5+": 1392,
  "N6b7": 1393,
  "N6b7+": 1394,
  "N6c4": 1395,
  "N6c4#": 1396,
  "N6c4+": 1397,
  "N6c5": 1398,
  "N6c5#": 1399,
  "N6c5+": 1400,
  "N6c7": 1401,
  "N6c7+": 1402,
  "N6d4": 1403,
  "N6d4+": 1404,
  "N6d5": 1405,
  "N6d5#": 1406,
  "N6d5+": 1407,
  "N6d7": 1408,
  "N6d7+": 1409,
  "N6e4": 1410,
  "N6e4#": 1411,
  "N6e4+": 1412,
  "N6e5": 1413,
  "N6e5#": 1414,
  "N6e5+": 1415,
  "N6e7": 1416,
  "N6e7+": 1417,
  "N6f4": 1418,
  "N6f4#": 1419,
  "N6f4+": 1420,
  "N6f5": 1421,
  "N6f5+": 1422,
  "N6f7": 1423,
  "N6f7+": 1424,
  "N6g4": 1425,
  "N6g4#": 1426,
  "N6g4+": 1427,
  "N6g5": 1428,
  "N6g5#": 1429,
  "N6g5+": 1430,
  "N6g7": 1431,
  "N6g7+": 1432,
  "N6h4": 1433,
  "N6h4+": 1434,
  "N6h5": 1435,
  "N6h5#": 1436,
  "N6h5+": 1437,
  "N6h7": 1438,
  "N6h7+": 1439,
  "N6xa4": 1440,
  "N6xa4+": 1441,
  "N6xa5": 1442,
  "N6xa5+": 1443,
  "N6xa7": 1444,
  "N6xb4": 1445,
  "N6xb4+": 1446,
  "N6xb5": 1447,
  "N6xb5+": 1448,
  "N6xb7": 1449,
  "N6xc4": 1450,
  "N6xc4+": 1451,
  "N6xc5": 1452,
  "N6xc5+": 1453,
  "N6xc7": 1454,
  "N6xd4": 1455,
  "N6xd4+": 1456,
  "N6xd5": 1457,
  "N6xd5#": 1458,
  "N6xd5+": 1459,
  "N6xd7": 1460,
  "N6xe4": 1461,
  "N6xe4+": 1462,
  "N6xe5": 1463,
  "N6xe5+": 1464,
  "N6xe7": 1465,
  "N6xe7+": 1466,
  "N6xf4": 1467,
  "N6xf4+": 1468,
  "N6xf5": 1469,
  "N6xf5+": 1470,
  "N6xf7": 1471,
  "N6xf7+": 1472,
  "N6xg4": 1473,
  "N6xg4+": 1474,
  "N6xg5": 1475,
  "N6xg5+": 1476,
  "N6xg7": 1477,
  "N6xg7+": 1478,
  "N6xh4": 1479,
  "N6xh5": 1480,
  "N6xh5+": 1481,
  "N6xh7": 1482,
  "N7a5": 1483,
  "N7a5+": 1484,
  "N7a6": 1485,
  "N7a6+": 1486,
  "N7b5": 1487,
  "N7b5+": 1488,
  "N7b6": 1489,
  "N7b6+": 1490,
  "N7c5": 1491,
  "N7c5+": 1492,
  "N7c6": 1493,
  "N7c6+": 1494,
  "N7d5": 1495,
  "N7d5#": 1496,
  "N7d5+": 1497,
  "N7d6": 1498,
  "N7d6+": 1499,
  "N7e5": 1500,
  "N7e5#": 1501,
  "N7e5+": 1502,
  "N7e6": 1503,
  "N7e6#": 1504,
  "N7e6+": 1505,
  "N7f5": 1506,
  "N7f5+": 1507,
  "N7f6": 1508,
  "N7f6#": 1509,
  "N7f6+": 1510,
  "N7g5": 1511,
  "N7g5#": 1512,
  "N7g5+": 1513,
  "N7g6": 1514,
  "N7g6#": 1515,
  "N7g6+": 1516,
  "N7h5": 1517,
  "N7h5+": 1518,
  "N7h6": 1519,
  "N7h6+": 1520,
  "N7xa5": 1521,
  "N7xa5+": 1522,
  "N7xa6": 1523,
  "N7xa6+": 1524,
  "N7xb5": 1525,
  "N7xb5+": 1526,
  "N7xb6": 1527,
  "N7xb6+": 1528,
  "N7xc5": 1529,
  "N7xc5+": 1530,
  "N7xc6": 1531,
  "N7xc6+": 1532,
  "N7xd5": 1533,
  "N7xd5+": 1534,
  "N7xd6": 1535,
  "N7xd6+": 1536,
  "N7xe5": 1537,
  "N7xe5+": 1538,
  "N7xe6": 1539,
  "N7xe6+": 1540,
  "N7xf5": 1541,
  "N7xf5+": 1542,
  "N7xf6": 1543,
  "N7xf6+": 1544,
  "N7xg5": 1545,
  "N7xg5+": 1546,
  "N7xg6": 1547,
  "N7xg6+": 1548,
  "N7xh5": 1549,
  "N7xh5+": 1550,
  "N7xh6": 1551,
  "N7xh6+": 1552,
  "N8a6": 1553,
  "N8a6+": 1554,
  "N8a7": 1555,
  "N8a7+": 1556,
  "N8b6": 1557,
  "N8b6+": 1558,
  "N8b7": 1559,
  "N8b7+": 1560,
  "N8c6": 1561,
  "N8c6+": 1562,
  "N8c7": 1563,
  "N8c7+": 1564,
  "N8d6": 1565,
  "N8d6+": 1566,
  "N8d7": 1567,
  "N8d7+": 1568,
  "N8e6": 1569,
  "N8e6+": 1570,
  "N8e7": 1571,
  "N8e7+": 1572,
  "N8f6": 1573,
  "N8f6#": 1574,
  "N8f6+": 1575,
  "N8f7": 1576,
  "N8f7+": 1577,
  "N8g6": 1578,
  "N8g6+": 1579,
  "N8g7": 1580,
  "N8g7+": 1581,
  "N8h6": 1582,
  "N8h6+": 1583,
  "N8h7": 1584,
  "N8h7+": 1585,
  "N8xa6": 1586,
  "N8xa6+": 1587,
  "N8xa7": 1588,
  "N8xb6": 1589,
  "N8xb6+": 1590,
  "N8xb7": 1591,
  "N8xb7+": 1592,
  "N8xc6": 1593,
  "N8xc6+": 1594,
  "N8xc7": 1595,
  "N8xd6": 1596,
  "N8xd6+": 1597,
  "N8xd7": 1598,
  "N8xe6": 1599,
  "N8xe6+": 1600,
  "N8xe7": 1601,
  "N8xe7+": 1602,
  "N8xf6": 1603,
  "N8xf6#": 1604,
  "N8xf6+": 1605,
  "N8xf7": 1606,
  "N8xf7+": 1607,
  "N8xg6": 1608,
  "N8xg6+": 1609,
  "N8xg7": 1610,
  "N8xh6": 1611,
  "N8xh7": 1612,
  "Na1": 1613,
  "Na1#": 1614,
  "Na1+": 1615,
  "Na2": 1616,
  "Na2#": 1617,
  "Na2+": 1618,
  "Na3": 1619,
  "Na3#": 1620,
  "Na3+": 1621,
  "Na4": 1622,
  "Na4#": 1623,
  "Na4+": 1624,
  "Na5": 1625,
  "Na5#": 1626,
  "Na5+": 1627,
  "Na6": 1628,
  "Na6#": 1629,
  "Na6+": 1630,
  "Na7": 1631,
  "Na7#": 1632,
  "Na7+": 1633,
  "Na8": 1634,
  "Na8#": 1635,
  "Na8+": 1636,
  "Nab1": 1637,
  "Nab1+": 1638,
  "Nab2": 1639,
  "Nab2#": 1640,
  "Nab2+": 1641,
  "Nab3": 1642,
  "Nab3#": 1643,
  "Nab3+": 1644,
  "Nab4": 1645,
  "Nab4#": 1646,
  "Nab4+": 1647,
  "Nab5": 1648,
  "Nab5#": 1649,
  "Nab5+": 1650,
  "Nab6": 1651,
  "Nab6#": 1652,
  "Nab6+": 1653,
  "Nab7": 1654,
  "Nab7+": 1655,
  "Nab8": 1656,
  "Nab8+": 1657,
  "Nac1": 1658,
  "Nac1+": 1659,
  "Nac2": 1660,
  "Nac2+": 1661,
  "Nac3": 1662,
  "Nac3#": 1663,
  "Nac3+": 1664,
  "Nac4": 1665,
  "Nac4#": 1666,
  "Nac4+": 1667,
  "Nac5": 1668,
  "Nac5#": 1669,
  "Nac5+": 1670,
  "Nac6": 1671,
  "Nac6#": 1672,
  "Nac6+": 1673,
  "Nac7": 1674,
  "Nac7#": 1675,
  "Nac7+": 1676,
  "Nac8": 1677,
  "Nac8+": 1678,
  "Naxb1": 1679,
  "Naxb1+": 1680,
  "Naxb2": 1681,
  "Naxb2+": 1682,
  "Naxb3": 1683,
  "Naxb3+": 1684,
  "Naxb4": 1685,
  "Naxb4+": 1686,
  "Naxb5": 1687,
  "Naxb5+": 1688,
  "Naxb6": 1689,
  "Naxb6+": 1690,
  "Naxb7": 1691,
  "Naxb7+": 1692,
  "Naxb8": 1693,
  "Naxc1": 1694,
  "Naxc1+": 1695,
  "Naxc2": 1696,
  "Naxc2+": 1697,
  "Naxc3": 1698,
  "Naxc3#": 1699,
  "Naxc3+": 1700,
  "Naxc4": 1701,
  "Naxc4+": 1702,
  "Naxc5": 1703,
  "Naxc5+": 1704,
  "Naxc6": 1705,
  "Naxc6+": 1706,
  "Naxc7": 1707,
  "Naxc7+": 1708,
  "Naxc8": 1709,
  "Naxc8+": 1710,
  "Nb1": 1711,
  "Nb1#": 1712,
  "Nb1+": 1713,
  "Nb2": 1714,
  "Nb2#": 1715,
  "Nb2+": 1716,
  "Nb3": 1717,
  "Nb3#": 1718,
  "Nb3+": 1719,
  "Nb4": 1720,
  "Nb4#": 1721,
  "Nb4+": 1722,
  "Nb5": 1723,
  "Nb5#": 1724,
  "Nb5+": 1725,
  "Nb6": 1726,
  "Nb6#": 1727,
  "Nb6+": 1728,
  "Nb7": 1729,
  "Nb7#": 1730,
  "Nb7+": 1731,
  "Nb8": 1732,
  "Nb8#": 1733,
  "Nb8+": 1734,
  "Nba1": 1735,
  "Nba2": 1736,
  "Nba2#": 1737,
  "Nba2+": 1738,
  "Nba3": 1739,
  "Nba3#": 1740,
  "Nba3+": 1741,
  "Nba4": 1742,
  "Nba4+": 1743,
  "Nba5": 1744,
  "Nba5#": 1745,
  "Nba5+": 1746,
  "Nba6": 1747,
  "Nba6#": 1748,
  "Nba6+": 1749,
  "Nba7": 1750,
  "Nba7#": 1751,
  "Nba7+": 1752,
  "Nba8": 1753,
  "Nbc1": 1754,
  "Nbc1+": 1755,
  "Nbc2": 1756,
  "Nbc2#": 1757,
  "Nbc2+": 1758,
  "Nbc3": 1759,
  "Nbc3#": 1760,
  "Nbc3+": 1761,
  "Nbc4": 1762,
  "Nbc4#": 1763,
  "Nbc4+": 1764,
  "Nbc5": 1765,
  "Nbc5#": 1766,
  "Nbc5+": 1767,
  "Nbc6": 1768,
  "Nbc6#": 1769,
  "Nbc6+": 1770,
  "Nbc7": 1771,
  "Nbc7#": 1772,
  "Nbc7+": 1773,
  "Nbc8": 1774,
  "Nbc8+": 1775,
  "Nbd1": 1776,
  "Nbd1#": 1777,
  "Nbd1+": 1778,
  "Nbd2": 1779,
  "Nbd2#": 1780,
  "Nbd2+": 1781,
  "Nbd3": 1782,
  "Nbd3#": 1783,
  "Nbd3+": 1784,
  "Nbd4": 1785,
  "Nbd4#": 1786,
  "Nbd4+": 1787,
  "Nbd5": 1788,
  "Nbd5#": 1789,
  "Nbd5+": 1790,
  "Nbd6": 1791,
  "Nbd6#": 1792,
  "Nbd6+": 1793,
  "Nbd7": 1794,
  "Nbd7#": 1795,
  "Nbd7+": 1796,
  "Nbd8": 1797,
  "Nbd8+": 1798,
  "Nbxa1": 1799,
  "Nbxa2": 1800,
  "Nbxa2#": 1801,
  "Nbxa2+": 1802,
  "Nbxa3": 1803,
  "Nbxa3+": 1804,
  "Nbxa4": 1805,
  "Nbxa4+": 1806,
  "Nbxa5": 1807,
  "Nbxa5+": 1808,
  "Nbxa6": 1809,
  "Nbxa6+": 1810,
  "Nbxa7": 1811,
  "Nbxa7#": 1812,
  "Nbxa7+": 1813,
  "Nbxa8": 1814,
  "Nbxc1": 1815,
  "Nbxc1+": 1816,
  "Nbxc2": 1817,
  "Nbxc2#": 1818,
  "Nbxc2+": 1819,
  "Nbxc3": 1820,
  "Nbxc3+": 1821,
  "Nbxc4": 1822,
  "Nbxc4+": 1823,
  "Nbxc5": 1824,
  "Nbxc5+": 1825,
  "Nbxc6": 1826,
  "Nbxc6+": 1827,
  "Nbxc7": 1828,
  "Nbxc7#": 1829,
  "Nbxc7+": 1830,
  "Nbxc8": 1831,
  "Nbxc8+": 1832,
  "Nbxd1": 1833,
  "Nbxd1+": 1834,
  "Nbxd2": 1835,
  "Nbxd2+": 1836,
  "Nbxd3": 1837,
  "Nbxd3+": 1838,
  "Nbxd4": 1839,
  "Nbxd4+": 1840,
  "Nbxd5": 1841,
  "Nbxd5+": 1842,
  "Nbxd6": 1843,
  "Nbxd6+": 1844,
  "Nbxd7": 1845,
  "Nbxd7+": 1846,
  "Nbxd8": 1847,
  "Nbxd8+": 1848,
  "Nc1": 1849,
  "Nc1#": 1850,
  "Nc1+": 1851,
  "Nc2": 1852,
  "Nc2#": 1853,
  "Nc2+": 1854,
  "Nc3": 1855,
  "Nc3#": 1856,
  "Nc3+": 1857,
  "Nc4": 1858,
  "Nc4#": 1859,
  "Nc4+": 1860,
  "Nc5": 1861,
  "Nc5#": 1862,
  "Nc5+": 1863,
  "Nc6": 1864,
  "Nc6#": 1865,
  "Nc6+": 1866,
  "Nc7": 1867,
  "Nc7#": 1868,
  "Nc7+": 1869,
  "Nc8": 1870,
  "Nc8#": 1871,
  "Nc8+": 1872,
  "Nca1": 1873,
  "Nca1+": 1874,
  "Nca2": 1875,
  "Nca2+": 1876,
  "Nca3": 1877,
  "Nca3+": 1878,
  "Nca4": 1879,
  "Nca4+": 1880,
  "Nca5": 1881,
  "Nca5+": 1882,
  "Nca6": 1883,
  "Nca6+": 1884,
  "Nca7": 1885,
  "Nca7+": 1886,
  "Nca8": 1887,
  "Ncb1": 1888,
  "Ncb1+": 1889,
  "Ncb2": 1890,
  "Ncb2#": 1891,
  "Ncb2+": 1892,
  "Ncb3": 1893,
  "Ncb3#": 1894,
  "Ncb3+": 1895,
  "Ncb4": 1896,
  "Ncb4#": 1897,
  "Ncb4+": 1898,
  "Ncb5": 1899,
  "Ncb5#": 1900,
  "Ncb5+": 1901,
  "Ncb6": 1902,
  "Ncb6#": 1903,
  "Ncb6+": 1904,
  "Ncb7": 1905,
  "Ncb7#": 1906,
  "Ncb7+": 1907,
  "Ncb8": 1908,
  "Ncb8+": 1909,
  "Ncd1": 1910,
  "Ncd1+": 1911,
  "Ncd2": 1912,
  "Ncd2#": 1913,
  "Ncd2+": 1914,
  "Ncd3": 1915,
  "Ncd3#": 1916,
  "Ncd3+": 1917,
  "Ncd4": 1918,
  "Ncd4#": 1919,
  "Ncd4+": 1920,
  "Ncd5": 1921,
  "Ncd5#": 1922,
  "Ncd5+": 1923,
  "Ncd6": 1924,
  "Ncd6#": 1925,
  "Ncd6+": 1926,
  "Ncd7": 1927,
  "Ncd7#": 1928,
  "Ncd7+": 1929,
  "Ncd8": 1930,
  "Ncd8#": 1931,
  "Ncd8+": 1932,
  "Nce1": 1933,
  "Nce1+": 1934,
  "Nce2": 1935,
  "Nce2#": 1936,
  "Nce2+": 1937,
  "Nce3": 1938,
  "Nce3#": 1939,
  "Nce3+": 1940,
  "Nce4": 1941,
  "Nce4#": 1942,
  "Nce4+": 1943,
  "Nce5": 1944,
  "Nce5#": 1945,
  "Nce5+": 1946,
  "Nce6": 1947,
  "Nce6#": 1948,
  "Nce6+": 1949,
  "Nce7": 1950,
  "Nce7#": 1951,
  "Nce7+": 1952,
  "Nce8": 1953,
  "Nce8#": 1954,
  "Nce8+": 1955,
  "Ncxa1": 1956,
  "Ncxa2": 1957,
  "Ncxa2+": 1958,
  "Ncxa3": 1959,
  "Ncxa3+": 1960,
  "Ncxa4": 1961,
  "Ncxa4+": 1962,
  "Ncxa5": 1963,
  "Ncxa5+": 1964,
  "Ncxa6": 1965,
  "Ncxa6+": 1966,
  "Ncxa7": 1967,
  "Ncxa7+": 1968,
  "Ncxa8": 1969,
  "Ncxa8+": 1970,
  "Ncxb1": 1971,
  "Ncxb2": 1972,
  "Ncxb2+": 1973,
  "Ncxb3": 1974,
  "Ncxb3+": 1975,
  "Ncxb4": 1976,
  "Ncxb4+": 1977,
  "Ncxb5": 1978,
  "Ncxb5+": 1979,
  "Ncxb6": 1980,
  "Ncxb6+": 1981,
  "Ncxb7": 1982,
  "Ncxb7#": 1983,
  "Ncxb7+": 1984,
  "Ncxb8": 1985,
  "Ncxd1": 1986,
  "Ncxd1+": 1987,
  "Ncxd2": 1988,
  "Ncxd2+": 1989,
  "Ncxd3": 1990,
  "Ncxd3+": 1991,
  "Ncxd4": 1992,
  "Ncxd4+": 1993,
  "Ncxd5": 1994,
  "Ncxd5#": 1995,
  "Ncxd5+": 1996,
  "Ncxd6": 1997,
  "Ncxd6+": 1998,
  "Ncxd7": 1999,
  "Ncxd7+": 2000,
  "Ncxd8": 2001,
  "Ncxe1": 2002,
  "Ncxe1+": 2003,
  "Ncxe2": 2004,
  "Ncxe2+": 2005,
  "Ncxe3": 2006,
  "Ncxe3#": 2007,
  "Ncxe3+": 2008,
  "Ncxe4": 2009,
  "Ncxe4#": 2010,
  "Ncxe4+": 2011,
  "Ncxe5": 2012,
  "Ncxe5#": 2013,
  "Ncxe5+": 2014,
  "Ncxe6": 2015,
  "Ncxe6#": 2016,
  "Ncxe6+": 2017,
  "Ncxe7": 2018,
  "Ncxe7+": 2019,
  "Ncxe8": 2020,
  "Ncxe8+": 2021,
  "Nd1": 2022,
  "Nd1#": 2023,
  "Nd1+": 2024,
  "Nd2": 2025,
  "Nd2#": 2026,
  "Nd2+": 2027,
  "Nd3": 2028,
  "Nd3#": 2029,
  "Nd3+": 2030,
  "Nd4": 2031,
  "Nd4#": 2032,
  "Nd4+": 2033,
  "Nd5": 2034,
  "Nd5#": 2035,
  "Nd5+": 2036,
  "Nd6": 2037,
  "Nd6#": 2038,
  "Nd6+": 2039,
  "Nd7": 2040,
  "Nd7#": 2041,
  "Nd7+": 2042,
  "Nd8": 2043,
  "Nd8#": 2044,
  "Nd8+": 2045,
  "Ndb1": 2046,
  "Ndb1+": 2047,
  "Ndb2": 2048,
  "Ndb2#": 2049,
  "Ndb2+": 2050,
  "Ndb3": 2051,
  "Ndb3#": 2052,
  "Ndb3+": 2053,
  "Ndb4": 2054,
  "Ndb4#": 2055,
  "Ndb4+": 2056,
  "Ndb5": 2057,
  "Ndb5#": 2058,
  "Ndb5+": 2059,
  "Ndb6": 2060,
  "Ndb6#": 2061,
  "Ndb6+": 2062,
  "Ndb7": 2063,
  "Ndb7#": 2064,
  "Ndb7+": 2065,
  "Ndb8": 2066,
  "Ndb8+": 2067,
  "Ndc1": 2068,
  "Ndc1+": 2069,
  "Ndc2": 2070,
  "Ndc2#": 2071,
  "Ndc2+": 2072,
  "Ndc3": 2073,
  "Ndc3#": 2074,
  "Ndc3+": 2075,
  "Ndc4": 2076,
  "Ndc4#": 2077,
  "Ndc4+": 2078,
  "Ndc5": 2079,
  "Ndc5#": 2080,
  "Ndc5+": 2081,
  "Ndc6": 2082,
  "Ndc6#": 2083,
  "Ndc6+": 2084,
  "Ndc7": 2085,
  "Ndc7#": 2086,
  "Ndc7+": 2087,
  "Ndc8": 2088,
  "Ndc8+": 2089,
  "Nde1": 2090,
  "Nde1+": 2091,
  "Nde2": 2092,
  "Nde2#": 2093,
  "Nde2+": 2094,
  "Nde3": 2095,
  "Nde3#": 2096,
  "Nde3+": 2097,
  "Nde4": 2098,
  "Nde4#": 2099,
  "Nde4+": 2100,
  "Nde5": 2101,
  "Nde5#": 2102,
  "Nde5+": 2103,
  "Nde6": 2104,
  "Nde6#": 2105,
  "Nde6+": 2106,
  "Nde7": 2107,
  "Nde7#": 2108,
  "Nde7+": 2109,
  "Nde8": 2110,
  "Nde8#": 2111,
  "Nde8+": 2112,
  "Ndf1": 2113,
  "Ndf1#": 2114,
  "Ndf1+": 2115,
  "Ndf2": 2116,
  "Ndf2#": 2117,
  "Ndf2+": 2118,
  "Ndf3": 2119,
  "Ndf3#": 2120,
  "Ndf3+": 2121,
  "Ndf4": 2122,
  "Ndf4#": 2123,
  "Ndf4+": 2124,
  "Ndf5": 2125,
  "Ndf5#": 2126,
  "Ndf5+": 2127,
  "Ndf6": 2128,
  "Ndf6#": 2129,
  "Ndf6+": 2130,
  "Ndf7": 2131,
  "Ndf7#": 2132,
  "Ndf7+": 2133,
  "Ndf8": 2134,
  "Ndf8#": 2135,
  "Ndf8+": 2136,
  "Ndxb1": 2137,
  "Ndxb2": 2138,
  "Ndxb2+": 2139,
  "Ndxb3": 2140,
  "Ndxb3+": 2141,
  "Ndxb4": 2142,
  "Ndxb4#": 2143,
  "Ndxb4+": 2144,
  "Ndxb5": 2145,
  "Ndxb5+": 2146,
  "Ndxb6": 2147,
  "Ndxb6+": 2148,
  "Ndxb7": 2149,
  "Ndxb7+": 2150,
  "Ndxb8": 2151,
  "Ndxc1": 2152,
  "Ndxc1+": 2153,
  "Ndxc2": 2154,
  "Ndxc2#": 2155,
  "Ndxc2+": 2156,
  "Ndxc3": 2157,
  "Ndxc3+": 2158,
  "Ndxc4": 2159,
  "Ndxc4#": 2160,
  "Ndxc4+": 2161,
  "Ndxc5": 2162,
  "Ndxc5#": 2163,
  "Ndxc5+": 2164,
  "Ndxc6": 2165,
  "Ndxc6#": 2166,
  "Ndxc6+": 2167,
  "Ndxc7": 2168,
  "Ndxc7+": 2169,
  "Ndxc8": 2170,
  "Ndxc8+": 2171,
  "Ndxe1": 2172,
  "Ndxe1+": 2173,
  "Ndxe2": 2174,
  "Ndxe2+": 2175,
  "Ndxe3": 2176,
  "Ndxe3+": 2177,
  "Ndxe4": 2178,
  "Ndxe4+": 2179,
  "Ndxe5": 2180,
  "Ndxe5#": 2181,
  "Ndxe5+": 2182,
  "Ndxe6": 2183,
  "Ndxe6#": 2184,
  "Ndxe6+": 2185,
  "Ndxe7": 2186,
  "Ndxe7#": 2187,
  "Ndxe7+": 2188,
  "Ndxe8": 2189,
  "Ndxe8+": 2190,
  "Ndxf1": 2191,
  "Ndxf1+": 2192,
  "Ndxf2": 2193,
  "Ndxf2#": 2194,
  "Ndxf2+": 2195,
  "Ndxf3": 2196,
  "Ndxf3+": 2197,
  "Ndxf4": 2198,
  "Ndxf4#": 2199,
  "Ndxf4+": 2200,
  "Ndxf5": 2201,
  "Ndxf5+": 2202,
  "Ndxf6": 2203,
  "Ndxf6#": 2204,
  "Ndxf6+": 2205,
  "Ndxf7": 2206,
  "Ndxf7#": 2207,
  "Ndxf7+": 2208,
  "Ndxf8": 2209,
  "Ndxf8#": 2210,
  "Ndxf8+": 2211,
  "Ne1": 2212,
  "Ne1#": 2213,
  "Ne1+": 2214,
  "Ne2": 2215,
  "Ne2#": 2216,
  "Ne2+": 2217,
  "Ne3": 2218,
  "Ne3#": 2219,
  "Ne3+": 2220,
  "Ne4": 2221,
  "Ne4#": 2222,
  "Ne4+": 2223,
  "Ne5": 2224,
  "Ne5#": 2225,
  "Ne5+": 2226,
  "Ne5f3": 2227,
  "Ne6": 2228,
  "Ne6#": 2229,
  "Ne6+": 2230,
  "Ne7": 2231,
  "Ne7#": 2232,
  "Ne7+": 2233,
  "Ne8": 2234,
  "Ne8#": 2235,
  "Ne8+": 2236,
  "Nec1": 2237,
  "Nec1+": 2238,
  "Nec2": 2239,
  "Nec2#": 2240,
  "Nec2+": 2241,
  "Nec3": 2242,
  "Nec3#": 2243,
  "Nec3+": 2244,
  "Nec4": 2245,
  "Nec4#": 2246,
  "Nec4+": 2247,
  "Nec5": 2248,
  "Nec5#": 2249,
  "Nec5+": 2250,
  "Nec6": 2251,
  "Nec6#": 2252,
  "Nec6+": 2253,
  "Nec7": 2254,
  "Nec7#": 2255,
  "Nec7+": 2256,
  "Nec8": 2257,
  "Nec8+": 2258,
  "Ned1": 2259,
  "Ned1+": 2260,
  "Ned2": 2261,
  "Ned2#": 2262,
  "Ned2+": 2263,
  "Ned3": 2264,
  "Ned3#": 2265,
  "Ned3+": 2266,
  "Ned4": 2267,
  "Ned4#": 2268,
  "Ned4+": 2269,
  "Ned5": 2270,
  "Ned5#": 2271,
  "Ned5+": 2272,
  "Ned6": 2273,
  "Ned6#": 2274,
  "Ned6+": 2275,
  "Ned7": 2276,
  "Ned7#": 2277,
  "Ned7+": 2278,
  "Ned8": 2279,
  "Ned8+": 2280,
  "Nef1": 2281,
  "Nef1#": 2282,
  "Nef1+": 2283,
  "Nef2": 2284,
  "Nef2#": 2285,
  "Nef2+": 2286,
  "Nef3": 2287,
  "Nef3#": 2288,
  "Nef3+": 2289,
  "Nef4": 2290,
  "Nef4#": 2291,
  "Nef4+": 2292,
  "Nef5": 2293,
  "Nef5#": 2294,
  "Nef5+": 2295,
  "Nef6": 2296,
  "Nef6#": 2297,
  "Nef6+": 2298,
  "Nef7": 2299,
  "Nef7#": 2300,
  "Nef7+": 2301,
  "Nef8": 2302,
  "Nef8#": 2303,
  "Nef8+": 2304,
  "Neg1": 2305,
  "Neg1#": 2306,
  "Neg1+": 2307,
  "Neg2": 2308,
  "Neg2#": 2309,
  "Neg2+": 2310,
  "Neg3": 2311,
  "Neg3#": 2312,
  "Neg3+": 2313,
  "Neg4": 2314,
  "Neg4#": 2315,
  "Neg4+": 2316,
  "Neg5": 2317,
  "Neg5#": 2318,
  "Neg5+": 2319,
  "Neg6": 2320,
  "Neg6#": 2321,
  "Neg6+": 2322,
  "Neg7": 2323,
  "Neg7#": 2324,
  "Neg7+": 2325,
  "Neg8": 2326,
  "Neg8#": 2327,
  "Neg8+": 2328,
  "Nexc1": 2329,
  "Nexc1+": 2330,
  "Nexc2": 2331,
  "Nexc2#": 2332,
  "Nexc2+": 2333,
  "Nexc3": 2334,
  "Nexc3#": 2335,
  "Nexc3+": 2336,
  "Nexc4": 2337,
  "Nexc4+": 2338,
  "Nexc5": 2339,
  "Nexc5+": 2340,
  "Nexc6": 2341,
  "Nexc6+": 2342,
  "Nexc7": 2343,
  "Nexc7+": 2344,
  "Nexc8": 2345,
  "Nexc8+": 2346,
  "Nexd1": 2347,
  "Nexd1+": 2348,
  "Nexd2": 2349,
  "Nexd2+": 2350,
  "Nexd3": 2351,
  "Nexd3+": 2352,
  "Nexd4": 2353,
  "Nexd4+": 2354,
  "Nexd5": 2355,
  "Nexd5+": 2356,
  "Nexd6": 2357,
  "Nexd6+": 2358,
  "Nexd7": 2359,
  "Nexd7+": 2360,
  "Nexd8": 2361,
  "Nexd8+": 2362,
  "Nexf1": 2363,
  "Nexf1+": 2364,
  "Nexf2": 2365,
  "Nexf2#": 2366,
  "Nexf2+": 2367,
  "Nexf3": 2368,
  "Nexf3#": 2369,
  "Nexf3+": 2370,
  "Nexf4": 2371,
  "Nexf4#": 2372,
  "Nexf4+": 2373,
  "Nexf5": 2374,
  "Nexf5#": 2375,
  "Nexf5+": 2376,
  "Nexf6": 2377,
  "Nexf6#": 2378,
  "Nexf6+": 2379,
  "Nexf7": 2380,
  "Nexf7#": 2381,
  "Nexf7+": 2382,
  "Nexf8": 2383,
  "Nexf8+": 2384,
  "Nexg1": 2385,
  "Nexg2": 2386,
  "Nexg2+": 2387,
  "Nexg3": 2388,
  "Nexg3#": 2389,
  "Nexg3+": 2390,
  "Nexg4": 2391,
  "Nexg4#": 2392,
  "Nexg4+": 2393,
  "Nexg5": 2394,
  "Nexg5#": 2395,
  "Nexg5+": 2396,
  "Nexg6": 2397,
  "Nexg6#": 2398,
  "Nexg6+": 2399,
  "Nexg7": 2400,
  "Nexg7#": 2401,
  "Nexg7+": 2402,
  "Nexg8": 2403,
  "Nexg8+": 2404,
  "Nf1": 2405,
  "Nf1#": 2406,
  "Nf1+": 2407,
  "Nf2": 2408,
  "Nf2#": 2409,
  "Nf2+": 2410,
  "Nf3": 2411,
  "Nf3#": 2412,
  "Nf3+": 2413,
  "Nf4": 2414,
  "Nf4#": 2415,
  "Nf4+": 2416,
  "Nf5": 2417,
  "Nf5#": 2418,
  "Nf5+": 2419,
  "Nf6": 2420,
  "Nf6#": 2421,
  "Nf6+": 2422,
  "Nf7": 2423,
  "Nf7#": 2424,
  "Nf7+": 2425,
  "Nf8": 2426,
  "Nf8#": 2427,
  "Nf8+": 2428,
  "Nfd1": 2429,
  "Nfd1+": 2430,
  "Nfd2": 2431,
  "Nfd2#": 2432,
  "Nfd2+": 2433,
  "Nfd3": 2434,
  "Nfd3#": 2435,
  "Nfd3+": 2436,
  "Nfd4": 2437,
  "Nfd4#": 2438,
  "Nfd4+": 2439,
  "Nfd5": 2440,
  "Nfd5#": 2441,
  "Nfd5+": 2442,
  "Nfd6": 2443,
  "Nfd6#": 2444,
  "Nfd6+": 2445,
  "Nfd7": 2446,
  "Nfd7#": 2447,
  "Nfd7+": 2448,
  "Nfd8": 2449,
  "Nfd8#": 2450,
  "Nfd8+": 2451,
  "Nfe1": 2452,
  "Nfe1+": 2453,
  "Nfe2": 2454,
  "Nfe2#": 2455,
  "Nfe2+": 2456,
  "Nfe3": 2457,
  "Nfe3#": 2458,
  "Nfe3+": 2459,
  "Nfe4": 2460,
  "Nfe4#": 2461,
  "Nfe4+": 2462,
  "Nfe5": 2463,
  "Nfe5#": 2464,
  "Nfe5+": 2465,
  "Nfe6": 2466,
  "Nfe6#": 2467,
  "Nfe6+": 2468,
  "Nfe7": 2469,
  "Nfe7#": 2470,
  "Nfe7+": 2471,
  "Nfe8": 2472,
  "Nfe8+": 2473,
  "Nfg1": 2474,
  "Nfg1+": 2475,
  "Nfg2": 2476,
  "Nfg2#": 2477,
  "Nfg2+": 2478,
  "Nfg3": 2479,
  "Nfg3#": 2480,
  "Nfg3+": 2481,
  "Nfg4": 2482,
  "Nfg4#": 2483,
  "Nfg4+": 2484,
  "Nfg5": 2485,
  "Nfg5#": 2486,
  "Nfg5+": 2487,
  "Nfg6": 2488,
  "Nfg6#": 2489,
  "Nfg6+": 2490,
  "Nfg7": 2491,
  "Nfg7#": 2492,
  "Nfg7+": 2493,
  "Nfg8": 2494,
  "Nfg8+": 2495,
  "Nfh1": 2496,
  "Nfh2": 2497,
  "Nfh2#": 2498,
  "Nfh2+": 2499,
  "Nfh3": 2500,
  "Nfh3#": 2501,
  "Nfh3+": 2502,
  "Nfh4": 2503,
  "Nfh4+": 2504,
  "Nfh5": 2505,
  "Nfh5#": 2506,
  "Nfh5+": 2507,
  "Nfh6": 2508,
  "Nfh6#": 2509,
  "Nfh6+": 2510,
  "Nfh7": 2511,
  "Nfh7#": 2512,
  "Nfh7+": 2513,
  "Nfh8": 2514,
  "Nfxd1": 2515,
  "Nfxd1+": 2516,
  "Nfxd2": 2517,
  "Nfxd2+": 2518,
  "Nfxd3": 2519,
  "Nfxd3+": 2520,
  "Nfxd4": 2521,
  "Nfxd4#": 2522,
  "Nfxd4+": 2523,
  "Nfxd5": 2524,
  "Nfxd5#": 2525,
  "Nfxd5+": 2526,
  "Nfxd6": 2527,
  "Nfxd6+": 2528,
  "Nfxd7": 2529,
  "Nfxd7+": 2530,
  "Nfxd8": 2531,
  "Nfxd8+": 2532,
  "Nfxe1": 2533,
  "Nfxe1+": 2534,
  "Nfxe2": 2535,
  "Nfxe2+": 2536,
  "Nfxe3": 2537,
  "Nfxe3+": 2538,
  "Nfxe4": 2539,
  "Nfxe4+": 2540,
  "Nfxe5": 2541,
  "Nfxe5#": 2542,
  "Nfxe5+": 2543,
  "Nfxe6": 2544,
  "Nfxe6#": 2545,
  "Nfxe6+": 2546,
  "Nfxe7": 2547,
  "Nfxe7#": 2548,
  "Nfxe7+": 2549,
  "Nfxe8": 2550,
  "Nfxe8+": 2551,
  "Nfxg1": 2552,
  "Nfxg1+": 2553,
  "Nfxg2": 2554,
  "Nfxg2+": 2555,
  "Nfxg3": 2556,
  "Nfxg3#": 2557,
  "Nfxg3+": 2558,
  "Nfxg4": 2559,
  "Nfxg4#": 2560,
  "Nfxg4+": 2561,
  "Nfxg5": 2562,
  "Nfxg5+": 2563,
  "Nfxg6": 2564,
  "Nfxg6#": 2565,
  "Nfxg6+": 2566,
  "Nfxg7": 2567,
  "Nfxg7#": 2568,
  "Nfxg7+": 2569,
  "Nfxg8": 2570,
  "Nfxh1": 2571,
  "Nfxh2": 2572,
  "Nfxh2#": 2573,
  "Nfxh2+": 2574,
  "Nfxh3": 2575,
  "Nfxh3+": 2576,
  "Nfxh4": 2577,
  "Nfxh4+": 2578,
  "Nfxh5": 2579,
  "Nfxh5+": 2580,
  "Nfxh6": 2581,
  "Nfxh6+": 2582,
  "Nfxh7": 2583,
  "Nfxh7+": 2584,
  "Nfxh8": 2585,
  "Ng1": 2586,
  "Ng1#": 2587,
  "Ng1+": 2588,
  "Ng2": 2589,
  "Ng2#": 2590,
  "Ng2+": 2591,
  "Ng3": 2592,
  "Ng3#": 2593,
  "Ng3+": 2594,
  "Ng4": 2595,
  "Ng4#": 2596,
  "Ng4+": 2597,
  "Ng5": 2598,
  "Ng5#": 2599,
  "Ng5+": 2600,
  "Ng6": 2601,
  "Ng6#": 2602,
  "Ng6+": 2603,
  "Ng7": 2604,
  "Ng7#": 2605,
  "Ng7+": 2606,
  "Ng8": 2607,
  "Ng8#": 2608,
  "Ng8+": 2609,
  "Nge1": 2610,
  "Nge1+": 2611,
  "Nge2": 2612,
  "Nge2#": 2613,
  "Nge2+": 2614,
  "Nge3": 2615,
  "Nge3#": 2616,
  "Nge3+": 2617,
  "Nge4": 2618,
  "Nge4#": 2619,
  "Nge4+": 2620,
  "Nge5": 2621,
  "Nge5#": 2622,
  "Nge5+": 2623,
  "Nge6": 2624,
  "Nge6#": 2625,
  "Nge6+": 2626,
  "Nge7": 2627,
  "Nge7#": 2628,
  "Nge7+": 2629,
  "Nge8": 2630,
  "Nge8#": 2631,
  "Nge8+": 2632,
  "Ngf1": 2633,
  "Ngf1+": 2634,
  "Ngf2": 2635,
  "Ngf2#": 2636,
  "Ngf2+": 2637,
  "Ngf3": 2638,
  "Ngf3#": 2639,
  "Ngf3+": 2640,
  "Ngf4": 2641,
  "Ngf4#": 2642,
  "Ngf4+": 2643,
  "Ngf5": 2644,
  "Ngf5#": 2645,
  "Ngf5+": 2646,
  "Ngf6": 2647,
  "Ngf6#": 2648,
  "Ngf6+": 2649,
  "Ngf7": 2650,
  "Ngf7#": 2651,
  "Ngf7+": 2652,
  "Ngf8": 2653,
  "Ngf8+": 2654,
  "Ngh1": 2655,
  "Ngh2": 2656,
  "Ngh2#": 2657,
  "Ngh2+": 2658,
  "Ngh3": 2659,
  "Ngh3#": 2660,
  "Ngh3+": 2661,
  "Ngh4": 2662,
  "Ngh4#": 2663,
  "Ngh4+": 2664,
  "Ngh5": 2665,
  "Ngh5#": 2666,
  "Ngh5+": 2667,
  "Ngh6": 2668,
  "Ngh6#": 2669,
  "Ngh6+": 2670,
  "Ngh7": 2671,
  "Ngh7#": 2672,
  "Ngh7+": 2673,
  "Ngh8": 2674,
  "Ngxe1": 2675,
  "Ngxe2": 2676,
  "Ngxe2+": 2677,
  "Ngxe3": 2678,
  "Ngxe3+": 2679,
  "Ngxe4": 2680,
  "Ngxe4+": 2681,
  "Ngxe5": 2682,
  "Ngxe5+": 2683,
  "Ngxe6": 2684,
  "Ngxe6#": 2685,
  "Ngxe6+": 2686,
  "Ngxe7": 2687,
  "Ngxe7+": 2688,
  "Ngxe8": 2689,
  "Ngxe8+": 2690,
  "Ngxf1": 2691,
  "Ngxf1+": 2692,
  "Ngxf2": 2693,
  "Ngxf2#": 2694,
  "Ngxf2+": 2695,
  "Ngxf3": 2696,
  "Ngxf3#": 2697,
  "Ngxf3+": 2698,
  "Ngxf4": 2699,
  "Ngxf4+": 2700,
  "Ngxf5": 2701,
  "Ngxf5+": 2702,
  "Ngxf6": 2703,
  "Ngxf6#": 2704,
  "Ngxf6+": 2705,
  "Ngxf7": 2706,
  "Ngxf7#": 2707,
  "Ngxf7+": 2708,
  "Ngxf8": 2709,
  "Ngxf8+": 2710,
  "Ngxh1": 2711,
  "Ngxh1+": 2712,
  "Ngxh2": 2713,
  "Ngxh2#": 2714,
  "Ngxh2+": 2715,
  "Ngxh3": 2716,
  "Ngxh3#": 2717,
  "Ngxh3+": 2718,
  "Ngxh4": 2719,
  "Ngxh4+": 2720,
  "Ngxh5": 2721,
  "Ngxh5+": 2722,
  "Ngxh6": 2723,
  "Ngxh6#": 2724,
  "Ngxh6+": 2725,
  "Ngxh7": 2726,
  "Ngxh7#": 2727,
  "Ngxh7+": 2728,
  "Ngxh8": 2729,
  "Nh1": 2730,
  "Nh1#": 2731,
  "Nh1+": 2732,
  "Nh2": 2733,
  "Nh2#": 2734,
  "Nh2+": 2735,
  "Nh3": 2736,
  "Nh3#": 2737,
  "Nh3+": 2738,
  "Nh4": 2739,
  "Nh4#": 2740,
  "Nh4+": 2741,
  "Nh5": 2742,
  "Nh5#": 2743,
  "Nh5+": 2744,
  "Nh6": 2745,
  "Nh6#": 2746,
  "Nh6+": 2747,
  "Nh7": 2748,
  "Nh7#": 2749,
  "Nh7+": 2750,
  "Nh8": 2751,
  "Nh8#": 2752,
  "Nh8+": 2753,
  "Nhf1": 2754,
  "Nhf1+": 2755,
  "Nhf2": 2756,
  "Nhf2#": 2757,
  "Nhf2+": 2758,
  "Nhf3": 2759,
  "Nhf3#": 2760,
  "Nhf3+": 2761,
  "Nhf4": 2762,
  "Nhf4#": 2763,
  "Nhf4+": 2764,
  "Nhf5": 2765,
  "Nhf5#": 2766,
  "Nhf5+": 2767,
  "Nhf6": 2768,
  "Nhf6#": 2769,
  "Nhf6+": 2770,
  "Nhf7": 2771,
  "Nhf7#": 2772,
  "Nhf7+": 2773,
  "Nhf8": 2774,
  "Nhf8+": 2775,
  "Nhg1": 2776,
  "Nhg1+": 2777,
  "Nhg2": 2778,
  "Nhg2#": 2779,
  "Nhg2+": 2780,
  "Nhg3": 2781,
  "Nhg3#": 2782,
  "Nhg3+": 2783,
  "Nhg4": 2784,
  "Nhg4#": 2785,
  "Nhg4+": 2786,
  "Nhg5": 2787,
  "Nhg5#": 2788,
  "Nhg5+": 2789,
  "Nhg6": 2790,
  "Nhg6#": 2791,
  "Nhg6+": 2792,
  "Nhg7": 2793,
  "Nhg7#": 2794,
  "Nhg7+": 2795,
  "Nhg8": 2796,
  "Nhg8+": 2797,
  "Nhxf1": 2798,
  "Nhxf1+": 2799,
  "Nhxf2": 2800,
  "Nhxf2#": 2801,
  "Nhxf2+": 2802,
  "Nhxf3": 2803,
  "Nhxf3#": 2804,
  "Nhxf3+": 2805,
  "Nhxf4": 2806,
  "Nhxf4#": 2807,
  "Nhxf4+": 2808,
  "Nhxf5": 2809,
  "Nhxf5#": 2810,
  "Nhxf5+": 2811,
  "Nhxf6": 2812,
  "Nhxf6#": 2813,
  "Nhxf6+": 2814,
  "Nhxf7": 2815,
  "Nhxf7+": 2816,
  "Nhxf8": 2817,
  "Nhxf8+": 2818,
  "Nhxg1": 2819,
  "Nhxg1+": 2820,
  "Nhxg2": 2821,
  "Nhxg2+": 2822,
  "Nhxg3": 2823,
  "Nhxg3+": 2824,
  "Nhxg4": 2825,
  "Nhxg4#": 2826,
  "Nhxg4+": 2827,
  "Nhxg5": 2828,
  "Nhxg5+": 2829,
  "Nhxg6": 2830,
  "Nhxg6#": 2831,
  "Nhxg6+": 2832,
  "Nhxg7": 2833,
  "Nhxg7+": 2834,
  "Nhxg8": 2835,
  "Nxa1": 2836,
  "Nxa1#": 2837,
  "Nxa1+": 2838,
  "Nxa2": 2839,
  "Nxa2#": 2840,
  "Nxa2+": 2841,
  "Nxa3": 2842,
  "Nxa3#": 2843,
  "Nxa3+": 2844,
  "Nxa4": 2845,
  "Nxa4#": 2846,
  "Nxa4+": 2847,
  "Nxa5": 2848,
  "Nxa5#": 2849,
  "Nxa5+": 2850,
  "Nxa6": 2851,
  "Nxa6#": 2852,
  "Nxa6+": 2853,
  "Nxa7": 2854,
  "Nxa7#": 2855,
  "Nxa7+": 2856,
  "Nxa8": 2857,
  "Nxa8#": 2858,
  "Nxa8+": 2859,
  "Nxb1": 2860,
  "Nxb1#": 2861,
  "Nxb1+": 2862,
  "Nxb2": 2863,
  "Nxb2#": 2864,
  "Nxb2+": 2865,
  "Nxb3": 2866,
  "Nxb3#": 2867,
  "Nxb3+": 2868,
  "Nxb4": 2869,
  "Nxb4#": 2870,
  "Nxb4+": 2871,
  "Nxb5": 2872,
  "Nxb5#": 2873,
  "Nxb5+": 2874,
  "Nxb6": 2875,
  "Nxb6#": 2876,
  "Nxb6+": 2877,
  "Nxb7": 2878,
  "Nxb7#": 2879,
  "Nxb7+": 2880,
  "Nxb8": 2881,
  "Nxb8#": 2882,
  "Nxb8+": 2883,
  "Nxc1": 2884,
  "Nxc1#": 2885,
  "Nxc1+": 2886,
  "Nxc2": 2887,
  "Nxc2#": 2888,
  "Nxc2+": 2889,
  "Nxc3": 2890,
  "Nxc3#": 2891,
  "Nxc3+": 2892,
  "Nxc4": 2893,
  "Nxc4#": 2894,
  "Nxc4+": 2895,
  "Nxc5": 2896,
  "Nxc5#": 2897,
  "Nxc5+": 2898,
  "Nxc6": 2899,
  "Nxc6#": 2900,
  "Nxc6+": 2901,
  "Nxc7": 2902,
  "Nxc7#": 2903,
  "Nxc7+": 2904,
  "Nxc8": 2905,
  "Nxc8#": 2906,
  "Nxc8+": 2907,
  "Nxd1": 2908,
  "Nxd1#": 2909,
  "Nxd1+": 2910,
  "Nxd2": 2911,
  "Nxd2#": 2912,
  "Nxd2+": 2913,
  "Nxd3": 2914,
  "Nxd3#": 2915,
  "Nxd3+": 2916,
  "Nxd4": 2917,
  "Nxd4#": 2918,
  "Nxd4+": 2919,
  "Nxd5": 2920,
  "Nxd5#": 2921,
  "Nxd5+": 2922,
  "Nxd6": 2923,
  "Nxd6#": 2924,
  "Nxd6+": 2925,
  "Nxd7": 2926,
  "Nxd7#": 2927,
  "Nxd7+": 2928,
  "Nxd8": 2929,
  "Nxd8#": 2930,
  "Nxd8+": 2931,
  "Nxe1": 2932,
  "Nxe1#": 2933,
  "Nxe1+": 2934,
  "Nxe2": 2935,
  "Nxe2#": 2936,
  "Nxe2+": 2937,
  "Nxe3": 2938,
  "Nxe3#": 2939,
  "Nxe3+": 2940,
  "Nxe4": 2941,
  "Nxe4#": 2942,
  "Nxe4+": 2943,
  "Nxe5": 2944,
  "Nxe5#": 2945,
  "Nxe5+": 2946,
  "Nxe6": 2947,
  "Nxe6#": 2948,
  "Nxe6+": 2949,
  "Nxe7": 2950,
  "Nxe7#": 2951,
  "Nxe7+": 2952,
  "Nxe8": 2953,
  "Nxe8#": 2954,
  "Nxe8+": 2955,
  "Nxf1": 2956,
  "Nxf1#": 2957,
  "Nxf1+": 2958,
  "Nxf2": 2959,
  "Nxf2#": 2960,
  "Nxf2+": 2961,
  "Nxf3": 2962,
  "Nxf3#": 2963,
  "Nxf3+": 2964,
  "Nxf4": 2965,
  "Nxf4#": 2966,
  "Nxf4+": 2967,
  "Nxf5": 2968,
  "Nxf5#": 2969,
  "Nxf5+": 2970,
  "Nxf6": 2971,
  "Nxf6#": 2972,
  "Nxf6+": 2973,
  "Nxf7": 2974,
  "Nxf7#": 2975,
  "Nxf7+": 2976,
  "Nxf8": 2977,
  "Nxf8#": 2978,
  "Nxf8+": 2979,
  "Nxg1": 2980,
  "Nxg1#": 2981,
  "Nxg1+": 2982,
  "Nxg2": 2983,
  "Nxg2#": 2984,
  "Nxg2+": 2985,
  "Nxg3": 2986,
  "Nxg3#": 2987,
  "Nxg3+": 2988,
  "Nxg4": 2989,
  "Nxg4#": 2990,
  "Nxg4+": 2991,
  "Nxg5": 2992,
  "Nxg5#": 2993,
  "Nxg5+": 2994,
  "Nxg6": 2995,
  "Nxg6#": 2996,
  "Nxg6+": 2997,
  "Nxg7": 2998,
  "Nxg7#": 2999,
  "Nxg7+": 3000,
  "Nxg8": 3001,
  "Nxg8#": 3002,
  "Nxg8+": 3003,
  "Nxh1": 3004,
  "Nxh1#": 3005,
  "Nxh1+": 3006,
  "Nxh2": 3007,
  "Nxh2#": 3008,
  "Nxh2+": 3009,
  "Nxh3": 3010,
  "Nxh3#": 3011,
  "Nxh3+": 3012,
  "Nxh4": 3013,
  "Nxh4#": 3014,
  "Nxh4+": 3015,
  "Nxh5": 3016,
  "Nxh5#": 3017,
  "Nxh5+": 3018,
  "Nxh6": 3019,
  "Nxh6#": 3020,
  "Nxh6+": 3021,
  "Nxh7": 3022,
  "Nxh7#": 3023,
  "Nxh7+": 3024,
  "Nxh8": 3025,
  "Nxh8#": 3026,
  "Nxh8+": 3027,
  "O-O": 3028,
  "O-O#": 3029,
  "O-O+": 3030,
  "O-O-O": 3031,
  "O-O-O#": 3032,
  "O-O-O+": 3033,
  "Q1a1": 3034,
  "Q1a1#": 3035,
  "Q1a1+": 3036,
  "Q1a2": 3037,
  "Q1a2#": 3038,
  "Q1a2+": 3039,
  "Q1a3": 3040,
  "Q1a3#": 3041,
  "Q1a3+": 3042,
  "Q1a4": 3043,
  "Q1a4#": 3044,
  "Q1a4+": 3045,
  "Q1a5": 3046,
  "Q1a5#": 3047,
  "Q1a5+": 3048,
  "Q1a6": 3049,
  "Q1a6#": 3050,
  "Q1a6+": 3051,
  "Q1a7": 3052,
  "Q1a7+": 3053,
  "Q1b1": 3054,
  "Q1b1#": 3055,
  "Q1b1+": 3056,
  "Q1b2": 3057,
  "Q1b2#": 3058,
  "Q1b2+": 3059,
  "Q1b3": 3060,
  "Q1b3#": 3061,
  "Q1b3+": 3062,
  "Q1b4": 3063,
  "Q1b4#": 3064,
  "Q1b4+": 3065,
  "Q1b5": 3066,
  "Q1b5#": 3067,
  "Q1b5+": 3068,
